---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarInSystem.ArrayLength
source: html/4c7280d4-3cad-d5bd-44db-c55ada9c03e4.htm
---
# Autodesk.Revit.DB.Structure.RebarInSystem.ArrayLength Property

Identifies the distribution path length of rebar set.

## Syntax (C#)
```csharp
public double ArrayLength { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - This rebar element represents a single bar (the layout rule is Single).